Repository: Pavlitto97/bio-mind-edu
Catalog: biomind_edu/lib/l10n/app_*.arb
Languages: uk

# lessonsTitle
source: Biology Lessons
uk: Уроки біології

# noLessonsAvailable
source: No lessons available yet
uk: Уроків поки немає

# checkBackSoon
source: Check back soon for exciting biology lessons!
uk: Незабаром з'являться цікаві уроки біології!

source: Failed to load lessons
uk: Не вдалося завантажити уроки

source: Settings
uk: Налаштування

# lessonCellStructure
source: Cell Structure
uk: Будова клітини

# lessonCellDescription
source: Explore the amazing world inside a living cell
uk: Досліджуй дивовижний світ всередині живої клітини

# lessonPlantLife
source: Plant Life
uk: Життя рослин

# lessonPlantDescription
source: Discover how plants grow and make food
uk: Дізнайся, як рослини ростуть і виробляють їжу

# lessonHumanHeart
source: Human Heart
uk: Серце людини

# lessonHeartDescription
source: Learn how your heart pumps blood through your body
uk: Дізнайся, як твоє серце перекачує кров по тілу

# difficultyBeginner
source: Beginner
uk: Початковий

# difficultyIntermediate
source: Intermediate
uk: Середній

source: Start Lesson
uk: Почати урок

source: Continue Lesson
uk: Продовжити урок

source: Lesson Completed!
uk: Урок завершено!

source: Interactive Task
uk: Інтерактивне завдання

source: Drag to Match
uk: Перетягни для з'єднання

# timeRemaining
source: Time: {seconds}s
uk: Час: {seconds}с

source: Correct!
uk: Правильно!

source: Try Again
uk: Спробуй ще раз

source: Assessment
uk: Оцінювання

# question
source: Question {current} of {total}
uk: Питання {current} з {total}

source: Submit
uk: Надіслати

source: Next
uk: Далі

source: Finish
uk: Завершити

source: Results
uk: Результати

source: Your Score
uk: Твій результат

# starsEarned
source: {stars} Stars
uk: {stars} зірок

source: Excellent!
uk: Чудово!

source: Great Job!
uk: Відмінна робота!

source: Good Effort!
uk: Добре!

source: Keep Practicing!
uk: Продовжуй вправлятися!

source: Rewards
uk: Нагороди

source: My Rewards
uk: Мої нагороди

# rewardsUnlocked
source: {count} Rewards Unlocked
uk: Нагороди відкрито: {count}

# lessonsCompleted
source: {count} Lessons
uk: Уроків: {count}

# testsCompleted
source: {count} Tests
uk: Тестів: {count}

source: Locked
uk: Заблоковано

source: Unlocked!
uk: Відкрито!

source: Congratulations!
uk: Вітаємо!

source: New Reward Unlocked!
uk: Нова нагорода відкрита!

source: View Rewards
uk: Переглянути нагороди

source: Back to Lessons
uk: Назад до уроків

source: Language
uk: Мова

# progressTitle
source: Learning Progress
uk: Прогрес навчання

source: Overall Progress
uk: Загальний прогрес

# averageScore
source: Avg Score
uk: Середній бал

# totalTime
source: Time
uk: Час

source: Completion Rate
uk: Рівень завершення

source: Lesson History
uk: Історія уроків

source: Test Results
uk: Результати тестів

# noLessonsYet
source: No lessons started yet
uk: Ще не розпочато жодного уроку

# noTestsYet
source: No tests completed yet
uk: Ще не завершено жодного тесту

source: Completed
uk: Завершено

source: In Progress
uk: Виконується

source: Not Started
uk: Не розпочато

source: attempt
uk: спроба

source: attempts
uk: спроб

source: Error loading progress
uk: Помилка завантаження прогресу

source: Error loading history
uk: Помилка завантаження історії

source: Error loading results
uk: Помилка завантаження результатів

# lessonsCellTitle
source: Cell Structure
uk: Будова Клітини

# lessonsCellDescription
source: 🔬 Journey inside a cell! Meet the nucleus-brain, membrane-guard, and mitochondria-batteries. Take apart the cell and discover how all parts work together! Fun and simple for little explorers! ✨
uk: 🔬 Подорож у світ клітини! Знайомся з ядром-мозком, мембраною-захисником і мітохондріями-батарейками. Розбери клітину на частини та дізнайся, як вони працюють разом! Весело і просто для малюків! ✨

# lessonsCellPartsNucleus
source: Nucleus
uk: Ядро

# lessonsCellPartsNucleusDescription
source: 🧠 The Brain of the Cell The nucleus is like the control center! It tells the cell what to do and stores all the important instructions (DNA).
uk: 🧠 Мозок Клітини Ядро - це командний центр! Воно керує клітиною і зберігає всі важливі інструкції (ДНК).

# lessonsCellPartsMembrane
source: Cell Membrane
uk: Клітинна Мембрана

# lessonsCellPartsMembraneDescription
source: 🛡️ The Protective Wall The membrane is like a bouncer at a club! It decides what goes in and out of the cell to keep it safe.
uk: 🛡️ Захисна Стіна Мембрана - це як охоронець! Вона вирішує, що заходить і виходить з клітини, щоб тримати її в безпеці.

# lessonsCellPartsMitochondria
source: Mitochondria
uk: Мітохондрії

# lessonsCellPartsMitochondriaDescription
source: ⚡ The Power Plant Mitochondria are like tiny batteries! They make energy so the cell can work and stay alive.
uk: ⚡ Електростанція Мітохондрії - це крихітні батарейки! Вони виробляють енергію, щоб клітина могла працювати.

# lessonsCellPartsCytoplasm
source: Cytoplasm
uk: Цитоплазма

# lessonsCellPartsCytoplasmDescription
source: 🌊 The Jelly Inside Cytoplasm is like jelly that fills the cell! All the other parts float around in it.
uk: 🌊 Желе Всередині Цитоплазма - це як желе, що заповнює клітину! Всі інші частини плавають у ній.

# lessonsCellObjectivesTitle
source: What you'll learn
uk: Чому ти навчишся

# lessonsCellObjective1
source: What a cell is and why it's important
uk: Що таке клітина і чому вона важлива

# lessonsCellObjective2
source: Meet the nucleus, membrane, mitochondria, and cytoplasm
uk: Познайомишся з ядром, мембраною, мітохондріями та цитоплазмою

# lessonsCellObjective3
source: How each part helps the cell do its job
uk: Як кожна частина допомагає клітині працювати

# lessonsCellStepsTitle
source: Lesson steps
uk: Кроки уроку

# lessonsCellStep1
source: Look at the 3D cell and rotate it
uk: Подивись на 3D-клітину та поверни її

# lessonsCellStep2
source: Tap each glowing dot to learn about that part
uk: Натисни на сяючі точки, щоб дізнатись про частини

# lessonsCellStep3
source: Complete the mini-game: match parts to names
uk: Виконай міні-гру: з'єднай частини з назвами

# lessonsCellStep4
source: Take a tiny quiz to earn your sticker!
uk: Пройди маленький тест і отримай наліпку!

# lessonsPlantTitle
source: Plant Life
uk: Життя Рослин

# lessonsPlantDescription
source: 🌱 Green wonders all around! Learn how roots drink water, stems carry food, and leaves make magic with sunshine. Build a plant from parts and become a real botanist! 🌿✨
uk: 🌱 Зелені чудеса навколо нас! Дізнайся, як коріння п'ють водичку, стебло несе їжу, а листочки роблять магію під сонцем. Збери рослину з частин і стань справжнім ботаніком! 🌿✨

# lessonsHeartTitle
source: Human Heart
uk: Людське Серце

# lessonsHeartDescription
source: ❤️ Your heart is a super muscle! It pumps blood day and night to deliver oxygen to every part of your body. Explore chambers, valves and learn how this amazing pump of life works! 💓🩺
uk: ❤️ Твоє серце - супер-м'яз! Воно качає кров день і ніч, щоб доставити кисень усім частинам тіла. Досліджуй камери, клапани і дізнайся, як працює ця дивовижна помпа життя! 💓🩺

# lessonsHeartPartsLeftAtrium
source: Left Atrium
uk: Ліве Передсердя

# lessonsHeartPartsLeftAtriumDescription
source: 📥 Top Left Chamber This room receives fresh oxygen-rich blood from the lungs!
uk: 📥 Верхня Ліва Камера Ця кімната отримує свіжу кров з киснем з легенів!

# lessonsHeartPartsLeftVentricle
source: Left Ventricle
uk: Лівий Шлуночок

# lessonsHeartPartsLeftVentricleDescription
source: 💪 Strong Pump The strongest part! It pumps blood to your whole body.
uk: 💪 Сильна Помпа Найсильніша частина! Вона качає кров по всьому тілу.

# lessonsHeartPartsRightAtrium
source: Right Atrium
uk: Праве Передсердя

# lessonsHeartPartsRightAtriumDescription
source: 📥 Top Right Chamber This room receives blood that needs fresh oxygen from your body.
uk: 📥 Верхня Права Камера Ця кімната отримує кров, якій потрібен свіжий кисень з твого тіла.

# lessonsHeartPartsRightVentricle
source: Right Ventricle
uk: Правий Шлуночок

# lessonsHeartPartsRightVentricleDescription
source: 🫁 Lung Pump This pumps blood to your lungs to get fresh oxygen!
uk: 🫁 Легенева Помпа Вона качає кров до легенів, щоб отримати свіжий кисень!
